![DSB logo](img/Dolan.jpg)
# Apply Functions to Your DataFrame

## PD4E Chapter 9: Apply
### How do you read/manipulate/store data in Python?

# What You Learned in Python/Pandas that could Apply Here

You will need following knowledge from the first half of this course:
1. functions
2. subsetting/slicing data
3. Loops

# What You will Learn in this Chapter

You will learn following techniques in this chapter:
1. how to apply functions to columns, rows, or the whole DataFrame
2. Different use cases between `.apply()`, `.map()`, and `.applymap()`
3. `lambda` - the nameless, defintion-less functions

# Review of Functions

- Functions are __reusable__ code blocks 
    - where we group some statements together
- In `pandas`, we use functions a lot, particularly in the data preprocessing step
    - e.g., write a function to calculate some values, for consistency we want to use it to all applicable columns
- Functions can be categorized as _fruitful_ and _void_
    - here we mostly care about _fruitful_ functions

In [17]:
# example of a fruitful function
def avg_2(x, y = 10):
    return (x + y) / 2

avg_2(4)

7.0

# Why `.apply()`?

- when you want to use a function on a DataFrame, directly calling the function on it, or its columns will  actually work
    - but sometimes it does not work as we expected
- consider `.apply()` as `pandas` way of calling functions
    - note that you still have to define your function

In [18]:
# an example
import pandas as pd

df1=pd.DataFrame({'a':[10,20,30],
                 'b':[20,30,40]})
df1

    a   b
0  10  20
1  20  30
2  30  40

In [19]:
# function def. - calculate square
def my_sq(x):
    return x ** 2

In [20]:
# let's try calling the function the normal way
my_sq(df1['a'])

0    100
1    400
2    900
Name: a, dtype: int64

In [21]:
# how about the whole DF?
my_sq(df1)

     a     b
0  100   400
1  400   900
2  900  1600

# What happened above?

- Looks like we can call the function (`my_sq()`) the normal way, and it does work on either a column or the whole DF
- Now why do we need `.apply()`?
    - we know functions can take arguments, maybe it does not work with arguments?
    - Look at the example below

In [22]:
# function def. - calculate square
def my_exp(x, e):
    return x ** e

In [23]:
my_exp(2, 3)

8

In [24]:
# it appears that taking parameters is not a problem
# let's come back to the 'why' part later
my_exp(df1['a'], 2)

0    100
1    400
2    900
Name: a, dtype: int64

# How `.apply()` works?

- `.apply()` is essentially a Series method 
    - which means natively we can _apply_ a function to a Series (column)
    - what `.apply()` does is that for every element in the series, the function is applied to it
        - and the results are returned as a Series of the same length

In [25]:
sq = df1['a'].apply(my_sq)
sq

0    100
1    400
2    900
Name: a, dtype: int64

In [26]:
cb = df1['a'].apply(my_exp, e=2)
cb

0    100
1    400
2    900
Name: a, dtype: int64

In [27]:
cb1 = []
for v in df1['a'].values:
    #print(v)
    cb1.append(my_exp(v, 2))
pd.Series(cb1)

0    100
1    400
2    900
dtype: int64

# What happened above?

- as you saw in these examples, `.apply()` works like with a `for` loop embedded
    - the function (e.g., `my_exp()`) is broadcasted to all the values in the Series (`df1['a']`)
    - and the return value is automatically converted to a `pandas.Series`
- this is how we avoid using `for` loops in `pandas`
    - as we said before, `for` loops are expensive, try avoiding them whenever you can
    - this is the first benefit of using `.apply()`

In [28]:
# we can do the same to a DF
# note that one different between `.apply()` and the regular function call is
# in `.apply()` you have to say explicitly what is the name of the argument (`e`)
df1.apply(my_exp, e=2)

     a     b
0  100   400
1  400   900
2  900  1600

In [29]:
# but if you try to apply a function with unmatched number of inputs
# it will raise an error - see this example

# this function takes three inputs
def avg_3(x, y, z):
    return (x + y + z) / 3

In [30]:
# when you apply the function to `df1` - since `df1` only has two columns
# this will raise an error
df1.apply(avg_3)

TypeError: ("avg_3() missing 2 required positional arguments: 'y' and 'z'", 'occurred at index a')

In [ ]:
# consider the logic above - maybe we want to take the average of each column?
# we can rewrit the function like below
def avg_3_apply(col):
    x = col[0]
    y = col[1]
    z = col[2]
    return (x + y + z) / 3

In [ ]:
# now it works
df1.apply(avg_3_apply)

# Your Turn Here

Explain why above code works.

# `.apply()` Works on Columns Natively

- Above example shows an important thing
    - do you want to apply the funtion to each column or each row
    - natively `.apply()` works on columns
    - but you can change that by adding an argument `axis=0` so it applies on _rows_

- note that in `pandas`, `axis=0` always refers to rows, and `axis=1` to columns

In [ ]:
df1.apply(avg_3_apply, axis=1)

In [ ]:
df1.apply(avg_3_apply, axis=0)

In [ ]:
# another example
def avg_2_apply(row):
    x = row[0]
    y = row[1]
    return (x + y) / 2

In [ ]:
df1.apply(avg_2_apply, axis=1)

In [ ]:
# another way of doing this - note that this is much more expensive than `.apply()`
for index, row in df1.iterrows(): # `.iterrows()` iterate through rows in a DF
    # print(index, row)
    # break
    # index is the index value of the row
    print(index, avg_2_apply(row))

# A More Complex Example of `.apply()`

- So far we have been playing with a very simple DF
- We actually use `.apply()` for more complicated use cases
    - e.g., testing the _missingness_ in a dataset

In [ ]:
# load a dataset
# the `titanic` dataset is one of the most popular dataset in analytics
import seaborn as sns
titanic = sns.load_dataset('titanic')
titanic.head()

In [ ]:
# in lecture 9, we had a way of calulating missingness
# count of missing values by column
titanic.isna().sum()

In [ ]:
# we can also calculate the ratio of missing values
(titanic.isna().sum()/titanic.shape[0]).round(4) * 100

In [ ]:
# we use np.sum() since you can only apply functions not methods
# `.sum()` as we used above is a method
import numpy as np
def count_missing(col):
    """Counts the number of missing values in a column
    """
    null_col = pd.isna(col)
    null_count = np.sum(null_col)
    return null_count

In [ ]:
cmis_col = titanic.apply(count_missing)
cmis_col

In [ ]:
cmis_row = titanic.apply(count_missing, axis=1)
cmis_row

# Your Turn Here

Please explain the results of the above code block.

# Lambda Functions

- Regular Python functions require a definition, and a name
- Sometimes the function is so simple that it does not deserve a definition and a name
- we call them anonymous functions - which is __lambda__
    - _lambda_ has no name, and takes _arguments_ and specifies an _expression_ (usually an one-liner)
    - you do not have to specify the return value - it is automatic
- __lambda__ has a structure as following:

```python
lambda arguments: expression
```

In [ ]:
# same as the my_exp function earlier
exp_lambda = lambda x, y: x ** y
exp_lambda(2, 3)

In [ ]:
exp_lambda(3, 2)

In [ ]:
exp_lambda(df1['a'], 2)

# When is the Best Time to use `lambda`?

- `lambda` is particularly useful when you deal with _lists_, _Series_, and _DataFrames_
    - In particular, when we need to transform a column in a DF
- the expression in `lambda` has to be simple enough
    - if the operation is complex, you can define it in a function, and use a lambda
    - if the operattion contains `if` statements or `for` loop, you should consider using a function rather than a `lambda`
- Being able to use `lambda` is the utmost benefit of using `.apply()`

In [ ]:
# this is how you apply lambda to a column
df1['a'].apply(exp_lambda, y=2)

In [ ]:
# an even easier way 
# you do not need any definition or function name
df1['a'].apply(lambda x: x**2)

In [ ]:
# a complex function
def my_gender(x):
    if x == 'female':
        return 'f'
    else:
        return 'm'

In [ ]:
# using lambda
titanic['sex'].apply(lambda x: my_gender(x)).head()

In [ ]:
# equivalent of above
titanic['sex'].apply(my_gender).head()

# Other Ways to Use Functions in `pandas`

- `.map()` is another method
- difference between `.map()` and `.apply()` is that 
    - `.map()` can only work on a single Series (column)
    - `.apply()` can work on the whole DataFrame

In [ ]:
df1.apply(lambda x: x**2)

In [ ]:
# this will cause an error
df1.map(lambda x: x**2)

# Other Ways to Use Functions in `pandas`

- since `.map()` has limited usabilty, only one column, it is not very useful
- but we have a hybrid method `.applymap()`
    - which is the combination of `.map()` nad `.apply()`
    - reason of using `.applymap()` is that it is much faster comparing to `.apply()`, and also works on the whole DF

In [ ]:
df1.applymap(lambda x: x**2)

# Popular Use Cases of `.apply()` and `lambda`

- We use the combination of `.apply()` and `lambda` in `pandas` when we are dealing with these scenarios
    - creating a new column based on an existing column
    - filtering a DataFrame (selecting a subset of columns)
    - extracting data from a column

In [ ]:
# let's reading a dataset as an example
# please change your PATH to `'/srv/data/my_shared_data_folder/ba505-data/IMDB-Movie-Data.csv'`
imdb_data = pd.read_csv('./data/IMDB-Movie-Data.csv')
imdb_data.head(2)

In [ ]:
# we can calculate the average rating of a movie
# by average the `Rating` and a tenth of the `Metascore`
imdb_data['AvgRating'] = (imdb_data['Rating'] + imdb_data['Metascore']/10)/2
imdb_data['AvgRating'].head()

In [ ]:
# we can filter the DF by the values of a certain column
# say we want to filter the `imdb_data` by the `Title` column
# if the column contains more than 4 words then we select them

long_title_movie_data = imdb_data[imdb_data['Title'].apply(lambda x: len(x.split())>=4)]
long_title_movie_data.head(3)

In [ ]:
name_df = pd.DataFrame(data = ['Braund, Mr. Owen Harris',
 'Cumings, Mrs. John Bradley (Florence Briggs Thayer)',
 'Heikkinen, Miss. Laina',
 'Futrelle, Mrs. Jacques Heath (Lily May Peel)',
 'Allen, Mr. William Henry',
 'Moran, Mr. James',
 'McCarthy, Mr. Timothy J',
 'Palsson, Master. Gosta Leonard',
 'Johnson, Mrs. Oscar W (Elisabeth Vilhelmina Berg)',
 'Nasser, Mrs. Nicholas (Adele Achem)'], columns = ['Name'] )

#Take a look at the Data 
name_df.head(3)

In [ ]:
# we observe the the title is always after the comma (`,`)
# and separate from the first name by a period (`.`)
# following code does the trick
name_df['Title'] = name_df['Name'].apply(lambda x: x.split(" ")[1].replace(".", ""))
name_df.head(3)

# Your Turn Here
Finish exercises below by following instructions of each of them.

## Q1. Coding Problem

Complete excecises regarding data types of the given DataFrame (`itinery_df`).

In [44]:
import random
import pandas as pd
import numpy as np
# generating the DF
duration_mins = pd.Series(random.sample(range(1, 1800), 20), name='duration_mins')
work_types = ['lecture', 'consulting', 'research']
work_type_series = pd.Series(random.choices(work_types, k=20), name='work_types')
locations = ['Beijing, China', 'London, England', 'Paris, France', 'Munich, Germany', 
             'Sydney, Australia', 'Mumbai, India', 'Madrid, Spain']
loc_series = pd.Series(random.choices(locations, k=20), name='locations')
hour_rates = pd.Series([round(random.uniform(10.0, 20.0), 2) for i in range(20)], name='hour_rates')
hour_rates.loc[random.sample(range(1, 20), 5)] = 'missing'
duration_mins.loc[random.sample(range(1, 20), 5)] = 'missing'
itinery_df = pd.concat([duration_mins, work_type_series, loc_series, hour_rates], axis=1)
#itinery_df['duration_mins'] = itinery_df['duration_mins'].astype(str)
itinery_df.head()

  duration_mins  work_types        locations hour_rates
0          1788    research    Paris, France      12.18
1           464    research    Paris, France      16.86
2          1772    research  Munich, Germany      13.37
3             8  consulting    Paris, France    missing
4          1545  consulting  Munich, Germany    missing

## Part 1:

Use `.apply()` and `lambda` to create a new column `duration_hrs` by converting `duration_mins` to hours (divide by `60`).
- make sure you handle all `'missing'` values in `duration_mins` - use the average of the column to replace missing values.

In [36]:
#missing values
itinery_df['duration_mins'] = itinery_df['duration_mins'].replace('missing',np.nan)
itinery_df['duration_mins'] = itinery_df['duration_mins'].fillna(itinery_df['duration_mins'].mean())
#create a new column
itinery_df['duration_hrs'] = itinery_df['duration_mins'].apply(lambda x: x/60)
itinery_df.head()

   duration_mins  work_types          locations hour_rates  duration_hrs
0     202.000000  consulting    London, England      15.69      3.366667
1     761.933333  consulting    Munich, Germany      19.85     12.698889
2     528.000000  consulting  Sydney, Australia      17.52      8.800000
3     761.933333  consulting     Beijing, China    missing     12.698889
4    1446.000000  consulting     Beijing, China    missing     24.100000

## Part 2:

Use `.apply()` and `lambda` to create two new columns `cities` and `countries`.

- `cities` refer to the first part in `locations` - before the `,`
- `countries` refer to the second part in `locations`
- note that there is a space after `,` that you need to remove

In [38]:
#split the string by the comma and take first half
#then same for second half as well
itinery_df['cities'] = itinery_df['locations'].apply(lambda x: x.strip().split(',')[0])
itinery_df['countries'] = itinery_df['locations'].apply(lambda x: x.strip().split(',')[1])
itinery_df

,duration_mins,work_types,locations,hour_rates,duration_hrs,cities,countries
0,202.000000,consulting,"London, England",15.69,3.366667,London,England
1,761.933333,consulting,"Munich, Germany",19.85,12.698889,Munich,Germany
2,528.000000,consulting,"Sydney, Australia",17.52,8.800000,Sydney,Australia
3,761.933333,consulting,"Beijing, China",missing,12.698889,Beijing,China
4,1446.000000,consulting,"Beijing, China",missing,24.100000,Beijing,China
5,1205.000000,lecture,"Sydney, Australia",17.77,20.083333,Sydney,Australia
6,1320.000000,research,"Paris, France",18.57,22.000000,Paris,France
7,761.933333,consulting,"Munich, Germany",19.05,12.698889,Munich,Germany
8,541.000000,research,"London, England",19.42,9.016667,London,England
9,1310.000000,research,"Madrid, Spain",missing,21.833333,Madrid,Spain
10,761.933333,lecture,"London, England",17.1,12.698889,London,England
11,1692.000000,lecture,"Sydney, Australia",12.67,28.200000,Sydney,Australia
12,342.000000,lecture,"Sydney, Australia",missing,5.700000,Sydney,Australia
13,295.000000,research,"Sydney, Australia",15.58,4.916667,Sydney,Australia
14,213.000000,research,"Madrid, Spain",18.13,3.550000,Madrid,Spain
15,715.000000,consulting,"Madrid, Spain",12.16,11.916667,Madrid,Spain
16,761.933333,consulting,"London, England",17.05,12.698889,London,England
17,1026.000000,lecture,"Mumbai, India",13.15,17.100000,Mumbai,India
18,4.000000,consulting,"Madrid, Spain",16.1,0.066667,Madrid,Spain
19,590.000000,research,"Munich, Germany",missing,9.833333,Munich,Germany

## Part 3:

Use `.apply()` and `lambda` to create a column `work_load` using the following logic:

```python
if duration_hrs >= 20:
    # 'full_time'
else:
    # 'part_time'
```

In [51]:
def work_load(duration_hours):
    if itinery_df['duration_hrs'] >=20:
        itinery_df['work_load'] = 'full time'
    else:
        itinery_df['work_load'] = 'part time'
itinery_df.head()

  duration_mins  work_types        locations  hour_rates
0          1788    research    Paris, France    0.203000
1           464    research    Paris, France    0.281000
2          1772    research  Munich, Germany    0.222833
3             8  consulting    Paris, France    0.258211
4          1545  consulting  Munich, Germany    0.258211

In [42]:
#create a column for work_load
itinery_df['work_load'] = itinery_df['duration_hrs']
#here is the condition
itinery_df[itinery_df['work_load'] >=20]

,duration_mins,work_types,locations,hour_rates,duration_hrs,cities,countries,work_load
4,1446.0,consulting,"Beijing, China",missing,24.100000,Beijing,China,24.100000
5,1205.0,lecture,"Sydney, Australia",17.77,20.083333,Sydney,Australia,20.083333
6,1320.0,research,"Paris, France",18.57,22.000000,Paris,France,22.000000
9,1310.0,research,"Madrid, Spain",missing,21.833333,Madrid,Spain,21.833333
11,1692.0,lecture,"Sydney, Australia",12.67,28.200000,Sydney,Australia,28.200000

##  Part 4:

Use `.apply()` and `lambda` to calculate the total payment for each row, $ payment_{total} = duration_hr \times hour\_rate $.

In order to do that, you need to:
1. verify the `duration_hrs` and `hour_rates` are in the numerical (float) type.
2. handle all `'missing'` values in the `hour_rates` column - use the average of the column to replace missing values.
3. create a new column namely `payments`, then put the calculation results in it.

In [53]:
#taking care of missing values
itinery_df['hour_rates'] = itinery_df['hour_rates'].replace('missing',np.nan)
itinery_df['hour_rates'] = itinery_df['hour_rates'].fillna(itinery_df['hour_rates'].mean())

#create a new column
itinery_df['hour_rates'] = itinery_df['hour_rates'].apply(lambda x: x/60)
itinery_df.head()

  duration_mins  work_types        locations  hour_rates
0          1788    research    Paris, France    0.003383
1           464    research    Paris, France    0.004683
2          1772    research  Munich, Germany    0.003714
3             8  consulting    Paris, France    0.004304
4          1545  consulting  Munich, Germany    0.004304

In [52]:
#checking dtypes
itinery_df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 20 entries, 0 to 19
Data columns (total 4 columns):
duration_mins    20 non-null object
work_types       20 non-null object
locations        20 non-null object
hour_rates       20 non-null float64
dtypes: float64(1), object(3)
memory usage: 768.0+ bytes

## Part 5:

Create a new column `final_pay` using the following logic (note that `work_load`, `payments` and `final_pay` are column names):

```python

if work_load == 'full_time':
    final_pay = payment * 1.05
elif work_load == 'part_time':
    final_pay = payment * 0.95
```

In [55]:
def final_pay():
    if itinery_df['work_load'] == 'full_time':
        itinery_df['final_pay'] = itinery_df['total_payment'] * 1.05
    elif itinery_df ['work_load'] == 'part_time':
        itinery_df ['final_pay'] = itinery_df['total_payment'] * 0.95
    return itinery_df['final_pay']
final_pay

# Classwork (start here in class)
You can start working on them right now:
- Read Chapter 9 in PD4E 
- If time permits, start in on your homework. 
- Ask questions when you need help. Use this time to get help from the professor!

# Homework (do at home)
The following is due before class next week:
  - Any remaining classwork from tonight
  - DataCamp “Speed efficient methods for iterating through a DataFrame” assignment

Note: All work on DataCamp is logged. Don't try to fake it!

Please email [me](mailto:jtao@fairfield.edu) if you have any problems or questions.

![DSB logo](img/Dolan.jpg)
# Apply Functions to Your DataFrame

## PD4E Chapter 9: Apply
### How do you read/manipulate/store data in Python?